/* extracted from ANNOTATE::test_class_annotations */
::routine main public
  self~assertEquals("Willow", .tester~annotation('author'))
  self~assertEquals(.nil, .tester~annotation('notSet'))
  self~assertEquals("This is a test", .annotate.testgroup~annotation('HELP'))

  test = .stringtable~of(('AUTHOR', "Willow"))
  self~assertTrue(test~equivalent(.tester~annotations))

  self~assertEquals(.nil, .unannotated~annotation('help'))
  self~assertTrue(.stringTable~new~equivalent(.unannotated~annotations))

  .unannotated~annotations~help = "Something New"
  self~assertEquals("Something New", .unannotated~annotation('help'))

::class shim public
::method assertEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertNotEquals
  use arg expected, actual
  if expected == actual then do
    say "FAIL not-expected["expected"] actual["actual"]"
    exit 1
  end
::method assertTrue
  use arg condition
  if \condition then do
    say "FAIL expected true actual["condition"]"
    exit 1
  end
::method assertFalse
  use arg condition
  if condition then do
    say "FAIL expected false actual["condition"]"
    exit 1
  end
::method assertNull
  use arg actual
  if actual \== .nil then do
    say "FAIL expected nil actual["actual"]"
    exit 1
  end
::method assertNotNull
  use arg actual
  if actual == .nil then do
    say "FAIL expected non-nil actual nil"
    exit 1
  end
::method assertSame
  use arg expected, actual
  if \(expected == actual) then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertNotSame
  use arg expected, actual
  if expected == actual then do
    say "FAIL not-expected["expected"] actual["actual"]"
    exit 1
  end
::method expectSyntax
  use arg code
  nop
::method assertListEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertArrayEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
