/* extracted from ASSIGNMENT::test_1 */
::routine main public
   id=0010; ABBREV     =0010; self~assertSame(abbrev, id)
   id=0020; ABS        =0020; self~assertSame(abs, id)
   id=0030; ADDRESS    =0030; self~assertSame(address, id)
   id=0040; AND        =0040; self~assertSame(and, id)
   id=0050; ARG        =0050; self~assertSame(arg, id)
   id=0060; BITAND     =0060; self~assertSame(bitand, id)
   id=0070; BITOR      =0070; self~assertSame(bitor, id)
   id=0080; BITXOR     =0080; self~assertSame(bitxor, id)
   id=0090; BY         =0090; self~assertSame(by, id)
   id=0100; CALL       =0100; self~assertSame(call, id)
   id=0110; CENTER     =0110; self~assertSame(center, id)
   id=0120; CHARIN     =0120; self~assertSame(charin, id)
   id=0130; CHAROUT    =0130; self~assertSame(charout, id)
   id=0140; CHARS      =0140; self~assertSame(chars, id)
   id=0150; COMPARE    =0150; self~assertSame(compare, id)
   id=0160; CONDITION  =0160; self~assertSame(condition, id)
   id=0170; COPIES     =0170; self~assertSame(copies, id)
   id=0180; C2D        =0180; self~assertSame(c2d, id)
   id=0190; C2X        =0190; self~assertSame(c2x, id)
   id=0200; DATATYPE   =0200; self~assertSame(datatype, id)
   id=0210; DATE       =0210; self~assertSame(date, id)
   id=0220; DELSTR     =0220; self~assertSame(delstr, id)
   id=0230; DELWORD    =0230; self~assertSame(delword, id)
   id=0240; DIGITS     =0240; self~assertSame(digits, id)
   id=0250; DO         =0250; self~assertSame(do, id)
   id=0260; DROP       =0260; self~assertSame(drop, id)
   id=0270; D2C        =0270; self~assertSame(d2c, id)
   id=0280; D2X        =0280; self~assertSame(d2x, id)
   id=0290; ELSE       =0290; self~assertSame(else, id)
   id=0300; END        =0300; self~assertSame(end, id)
   id=0310; ERROR      =0310; self~assertSame(error, id)
   id=0320; ERRORTEXT  =0320; self~assertSame(errortext, id)
   id=0330; EXIT       =0330; self~assertSame(exit, id)
   id=0340; EXPOSE     =0340; self~assertSame(expose, id)
   id=0350; FAILURE    =0350; self~assertSame(failure, id)
   id=0360; FOR        =0360; self~assertSame(for, id)
   id=0370; FOREVER    =0370; self~assertSame(forever, id)
   id=0380; FORM       =0380; self~assertSame(form, id)
   id=0390; FORMAT     =0390; self~assertSame(format, id)
   id=0400; FUZZ       =0400; self~assertSame(fuzz, id)
   id=0410; HALT       =0410; self~assertSame(halt, id)
   id=0420; IF         =0420; self~assertSame(if, id)
   id=0430; INSERT     =0430; self~assertSame(insert, id)
   id=0440; INTERPRET  =0440; self~assertSame(interpret, id)
   id=0450; ITERATE    =0450; self~assertSame(iterate, id)
   id=0460; LASTPOS    =0460; self~assertSame(lastpos, id)
   id=0470; LEAVE      =0470; self~assertSame(leave, id)
   id=0480; LEFT       =0480; self~assertSame(left, id)
   id=0490; LENGTH     =0490; self~assertSame(length, id)
   id=0500; LINEIN     =0500; self~assertSame(linein, id)
   id=0510; LINEOUT    =0510; self~assertSame(lineout, id)
   id=0520; LINES      =0520; self~assertSame(lines, id)
   id=0530; MAX        =0530; self~assertSame(max, id)
   id=0540; MIN        =0540; self~assertSame(min, id)
   id=0550; NAME       =0550; self~assertSame(name, id)
   id=0560; NOP        =0560; self~assertSame(nop, id)
   id=0570; NOVALUE    =0570; self~assertSame(novalue, id)
   id=0580; OFF        =0580; self~assertSame(off, id)
   id=0590; ON         =0590; self~assertSame(on, id)
   id=0600; OPTIONS    =0600; self~assertSame(options, id)
   id=0610; OR         =0610; self~assertSame(or, id)
   id=0620; OTHERWISE  =0620; self~assertSame(otherwise, id)
   id=0630; OVERLAY    =0630; self~assertSame(overlay, id)
   id=0640; PARSE      =0640; self~assertSame(parse, id)
   id=0650; POS        =0650; self~assertSame(pos, id)
   id=0660; PROCEDURE  =0660; self~assertSame(procedure, id)
   id=0670; PULL       =0670; self~assertSame(pull, id)
   id=0680; PUSH       =0680; self~assertSame(push, id)
   id=0690; QUEUE      =0690; self~assertSame(queue, id)
   id=0700; RANDOM     =0700; self~assertSame(random, id)
   id=0710; RC         =0710; self~assertSame(rc, id)
   id=0720; RESULT     =0720; self~assertSame(result, id)
   id=0730; RETURN     =0730; self~assertSame(return, id)
   id=0740; REVERSE    =0740; self~assertSame(reverse, id)
   id=0750; RIGHT      =0750; self~assertSame(right, id)
   id=0760; SAY        =0760; self~assertSame(say, id)
   id=0770; SELECT     =0770; self~assertSame(select, id)
   id=0780; SIGL       =0780; self~assertSame(sigl, id)
   id=0790; SIGN       =0790; self~assertSame(sign, id)
   id=0800; SIGNAL     =0800; self~assertSame(signal, id)
   id=0810; SOURCE     =0810; self~assertSame(source, id)
   id=0820; SOURCELINE =0820; self~assertSame(sourceline, id)
   id=0830; SPACE      =0830; self~assertSame(space, id)
   id=0840; STRIP      =0840; self~assertSame(strip, id)
   id=0850; SUBSTR     =0850; self~assertSame(substr, id)
   id=0860; SUBWORD    =0860; self~assertSame(subword, id)
   id=0870; SYMBOL     =0870; self~assertSame(symbol, id)
   id=0880; SYNTAX     =0880; self~assertSame(syntax, id)
   id=0890; THEN       =0890; self~assertSame(then, id)
   id=0900; TIME       =0900; self~assertSame(time, id)
   id=0910; TO         =0910; self~assertSame(to, id)
   id=0920; TRACE      =0920; self~assertSame(trace, id)
   id=0930; TRANSLATE  =0930; self~assertSame(translate, id)
   id=0940; TRUNC      =0940; self~assertSame(trunc, id)
   id=0950; UNTIL      =0950; self~assertSame(until, id)
   id=0960; UPPER      =0960; self~assertSame(upper, id)
   id=0970; VALUE      =0970; self~assertSame(value, id)
   id=0980; VAR        =0980; self~assertSame(var, id)
   id=0990; VERIFY     =0990; self~assertSame(verify, id)
   id=1000; WHEN       =1000; self~assertSame(when, id)
   id=1010; WHILE      =1010; self~assertSame(while, id)
   id=1020; WORD       =1020; self~assertSame(word, id)
   id=1030; WORDINDEX  =1030; self~assertSame(wordindex, id)
   id=1040; WORDLENGTH =1040; self~assertSame(wordlength, id)
   id=1050; WORDPOS    =1050; self~assertSame(wordpos, id)
   id=1060; WORDS      =1060; self~assertSame(words, id)
   id=1070; XOR        =1070; self~assertSame(xor, id)
   id=1080; XRANGE     =1080; self~assertSame(xrange, id)
   id=1090; X2C        =1090; self~assertSame(x2c, id)
   id=1100; X2D        =1100; self~assertSame(x2d, id)

::class shim public
::method assertEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertNotEquals
  use arg expected, actual
  if expected == actual then do
    say "FAIL not-expected["expected"] actual["actual"]"
    exit 1
  end
::method assertTrue
  use arg condition
  if \condition then do
    say "FAIL expected true actual["condition"]"
    exit 1
  end
::method assertFalse
  use arg condition
  if condition then do
    say "FAIL expected false actual["condition"]"
    exit 1
  end
::method assertNull
  use arg actual
  if actual \== .nil then do
    say "FAIL expected nil actual["actual"]"
    exit 1
  end
::method assertNotNull
  use arg actual
  if actual == .nil then do
    say "FAIL expected non-nil actual nil"
    exit 1
  end
::method assertSame
  use arg expected, actual
  if \(expected == actual) then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertNotSame
  use arg expected, actual
  if expected == actual then do
    say "FAIL not-expected["expected"] actual["actual"]"
    exit 1
  end
::method expectSyntax
  use arg code
  nop
::method assertListEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertArrayEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
