/* extracted from bag::test_7 */
::routine main public
   bag1 = .bag~of("Mike", "David", "Sam")
   self~assertEquals(1, bag1~hasIndex("Mike"))
   bag1~put("Mike", "Mike")
   self~assertEquals(1, bag1~hasIndex("Mike"))
   bag1~put("Pete", "Pete")
   self~assertEquals(1, bag1~hasIndex("Pete"))
   bag1~put("Pete", "Pete")
   self~assertEquals(1, bag1~hasIndex("Pete"))
   self~assertEquals(6, bag1~items) -- make sure we have the duplicate indexes
   self~expectSyntax(93.949)
   bag1~put("Mike", "Linda")

::class shim public
::method assertEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertNotEquals
  use arg expected, actual
  if expected == actual then do
    say "FAIL not-expected["expected"] actual["actual"]"
    exit 1
  end
::method assertTrue
  use arg condition
  if \condition then do
    say "FAIL expected true actual["condition"]"
    exit 1
  end
::method assertFalse
  use arg condition
  if condition then do
    say "FAIL expected false actual["condition"]"
    exit 1
  end
::method assertNull
  use arg actual
  if actual \== .nil then do
    say "FAIL expected nil actual["actual"]"
    exit 1
  end
::method assertNotNull
  use arg actual
  if actual == .nil then do
    say "FAIL expected non-nil actual nil"
    exit 1
  end
::method assertSame
  use arg expected, actual
  if \(expected == actual) then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertNotSame
  use arg expected, actual
  if expected == actual then do
    say "FAIL not-expected["expected"] actual["actual"]"
    exit 1
  end
::method expectSyntax
  use arg code
  nop
::method assertListEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertArrayEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
