/* extracted from C2D::test_87 */
::routine main public
   NUMERIC DIGITS 5000

   v00x='00'X
   vFFx='FF'X

   v01="BB4BAB6F5A9ED2BBBD8A99C7A28BE570D4A65E56E1BFC15DFAE5F9C89A5FD6B8"X,
     ||"C378BA8582506E635473B1AAF3F2DAF7CAACC28EE54EB740D74AE2CBC6BFF776"X
   v02="51FEBBABE66CCAA9B46644D3BD6CD79F4461C1B846A955D1EC92574A6B5A558D"X,
     ||"90D9BB48AFAB866CC0B479409078FBC55C695DFCF14DC5C49DA85A79626CE46A"X
   v03="CA6C79588A546E7E7A708EE57543FBE44E5C95685CCC89BF95C3CB4B55FC4FCD"X,
     ||"AAD97D94B0967AE792AEE3565D6D9381C6BDB1FD7CA7F4E2E866A8564552745F"X
   v04="E7777ABCD5745FBCA5D396D9DBC747518B6ABE5CE9439ACBC3F6FBA3FC6AF8CB"X,
     ||"5144F49FC5734ADC5FA05AAA5495E0E8F24E52696CC94EC846F5"X
   v250c=v01||v02||v03||v04

   v01='8399992570886212898210064763300632659213758723524692731815729723'
   v02='4485239600113864892644027693929686541952088569508449875758978534'
   v03='7250283564182603397640792033860374527457008506814087148318918293'
   v04='7053241062225158147850374259431707295162537054624593573284160019'
   v05='1521465026506813043181491468846218144775956578900325585370837038'
   v06='5959146850703229564009203011773509601645163642927449415540968681'
   v07='0305846173056177558164003307412257475321207936620188340213190561'
   v08='0360396979586816767893592548124680109810471082375566313502602684'
   v09='6820028914107461615602989062098172689896112750796049912733308919'
   v10='39978072137454536559707893'
   v250cr=v01||v02||v03||v04||v05||v06||v07||v08||v09||v10

   v01='264333D9AD9AFBE209EC38481AA90929099E4F0D02E7F42465454F01DDDE2987'x
   v02='577845432F4F476BF3561185E80780DA2AAB410A383C924DF7F8FC15C2035A70'x
   v03='F8A89F84C2ECC4282D58F2B2547DC44383997AED27CFD373E2CE5FEC01A858B6'x
   v04='210A94DDE84816A93F37DD8E76917A458C32C4CEC2ADF8EE40272EAB62CAC520'x
   v05='634DA9B473B6826288224541F418268DA4755E4D33943E5078CE11626B0BF06D'x
   v06='833A752DCD94D04EE082664884BD1CFEF27D58BCC077A702A23B85963B5AA3C2'x
   v07='9E9577A47FE40F7D797DEFF316E2C45E516D239E2A2554340B598D5C0EFCAE62'x
   v08='044CBBCFCB422774A28AF341C9800357BB3062A6184767FC8307'x
   v250x=v01||v02||v03||v04||v05||v06||v07||v08

   v01='1716029770339205898960735936514265291017194828930208088658330166'
   v02='3234229432708330209315761563550795067085604495154844500814089065'
   v03='2337453024928566250318743427321217259073477562709265207261874580'
   v04='6420911513020684246333831548628254993163472738936530888197479462'
   v05='7270642649602502345254071295626952867548181775981056066431731040'
   v06='9274623755863853659588159271723614424599635769116525480224947288'
   v07='5160464503146021968989848713129410923837135793357996460129489375'
   v08='4710442959608538640262363033310358675300662957250486278428440575'
   v09='6940341092128660216264658308883788059491384003450936799112006077'
   v10='83609065435734472839168775'
   v250xr=v01||v02||v03||v04||v05||v06||v07||v08||v09||v10

   v01='1325663275005680322804098907303379155073488404867700957669879429'
   v02='1559472496806462264585427940364260650310599626991255597983351688'
   v03='0734861505506760231593208984407343487211021149655583188450859093'
   v04='3558116099786442606359219236066252013982288123804388258394156823'
   v05='1686983675184177077425881541472102481693918744949996198810229742'
   v06='1900446931029675428207508977329162416438144999657802430969023631'
   v07='9586204919126337158821731556452710302713234226242119468769523363'
   v08='5131830891810917501427406660643275459435389678994531640830743406'
   v09='9639985937218581740790339150611911231599916460683562547269961694'
   v10='042369584608571071940341'
   v250c249r=v01||v02||v03||v04||v05||v06||v07||v08||v09||v10

   v01='1177326954148433955262415351614359598406698989230115044932922884'
   v02='7676149016533336300597231354015512298367220754487435027073339315'
   v03='8434324917002956463775584511469618143590464708324280071370576403'
   v04='6063837801192937238785444408975391588612975183124271575572384168'
   v05='4404041852929962679698658530397484317148305472366904135930366036'
   v06='8037022381609191215697819666474660029872815771880829911912600028'
   v07='6003992182587897920439487521382935085759102017299564980880048541'
   v08='0966761476676918288581703171841536247599743290688415067665865310'
   v09='9703679223593037492020239721267556779061225866382373539059883990'
   v10='317318392910158996734727'
   v250x249r=v01||v02||v03||v04||v05||v06||v07||v08||v09||v10

   v01='-308131438185633234411826724847618718100941829736225927296069764'
   v02='4809138653912316649302192093772094044989250789439029640158573336'
   v03='1361277176724332795852586115153092536399611429319280064316348215'
   v04='5008965163678119047662778728693293154123219464797945306211293048'
   v05='0503669737230213158642413184280331801944601375378101858353814741'
   v06='9909687694414484957657980633599149468838200342333085580454035368'
   v07='1782332995373215416249589623222955522685677790378402764510513459'
   v08='3052903692250510378706419104154735905027148613425501644187782289'
   v09='9044012636938040257871755602705458514893013900355923809549511878'
   v10='877987381624730314589321483'
   v250c250r=v01||v02||v03||v04||v05||v06||v07||v08||v09||v10

   v01='1716029770339205898960735936514265291017194828930208088658330166'
   v02='3234229432708330209315761563550795067085604495154844500814089065'
   v03='2337453024928566250318743427321217259073477562709265207261874580'
   v04='6420911513020684246333831548628254993163472738936530888197479462'
   v05='7270642649602502345254071295626952867548181775981056066431731040'
   v06='9274623755863853659588159271723614424599635769116525480224947288'
   v07='5160464503146021968989848713129410923837135793357996460129489375'
   v08='4710442959608538640262363033310358675300662957250486278428440575'
   v09='6940341092128660216264658308883788059491384003450936799112006077'
   v10='83609065435734472839168775'
   v250x250r=v01||v02||v03||v04||v05||v06||v07||v08||v09||v10

   v01='8399992570886212898210064763300632659213758723524692731815729723'
   v02='4485239600113864892644027693929686541952088569508449875758978534'
   v03='7250283564182603397640792033860374527457008506814087148318918293'
   v04='7053241062225158147850374259431707295162537054624593573284160019'
   v05='1521465026506813043181491468846218144775956578900325585370837038'
   v06='5959146850703229564009203011773509601645163642927449415540968681'
   v07='0305846173056177558164003307412257475321207936620188340213190561'
   v08='0360396979586816767893592548124680109810471082375566313502602684'
   v09='6820028914107461615602989062098172689896112750796049912733308919'
   v10='39978072137454536559707893'
   v250c251r=v01||v02||v03||v04||v05||v06||v07||v08||v09||v10

   v01='1716029770339205898960735936514265291017194828930208088658330166'
   v02='3234229432708330209315761563550795067085604495154844500814089065'
   v03='2337453024928566250318743427321217259073477562709265207261874580'
   v04='6420911513020684246333831548628254993163472738936530888197479462'
   v05='7270642649602502345254071295626952867548181775981056066431731040'
   v06='9274623755863853659588159271723614424599635769116525480224947288'
   v07='5160464503146021968989848713129410923837135793357996460129489375'
   v08='4710442959608538640262363033310358675300662957250486278428440575'
   v09='6940341092128660216264658308883788059491384003450936799112006077'
   v10='83609065435734472839168775'
   v250x251r=v01||v02||v03||v04||v05||v06||v07||v08||v09||v10

   v01='-308131438185633234411826724847618718100941829736225927296069764'
   v02='4809138653912316649302192093772094044989250789439029640158573336'
   v03='1361277176724332795852586115153092536399611429319280064316348215'
   v04='5008965163678119047662778728693293154123219464797945306211293048'
   v05='0503669737230213158642413184280331801944601375378101858353814741'
   v06='9909687694414484957657980633599149468838200342333085580454035368'
   v07='1782332995373215416249589623222955522685677790378402764510513459'
   v08='3052903692250510378706419104154735905027148613425501644187782289'
   v09='9044012636938040257871755602705458514893013900355923809549511878'
   v10='877987381624730314589321483'
   v250FFc251r=v01||v02||v03||v04||v05||v06||v07||v08||v09||v10

   v01='-976527718240333934336759607526255454920598219195674391611809720'
   v02='1934239670652870117635018706809983192475899196874390177653062283'
   v03='0852560230649736510584790975807008263237964523729762258422052586'
   v04='8072198118598566437814432999773638384323125896366751574719961103'
   v05='6928751974920644228435155201602258329667378855670028810247725341'
   v06='7578140003898422548100085007604138986542753129714177973985637507'
   v07='4296871162364230975167005082651240177834085004704621952518883577'
   v08='8617899094248338191469542055636168048478129425938009647695198500'
   v09='8031981419135920397805588678026896977933486775090435120911642163'
   v10='034356388326450378309860601'
   v250FFx251r=v01||v02||v03||v04||v05||v06||v07||v08||v09||v10

   self~assertSame(C2D(v250c), v250cr)
   self~assertSame(C2D(v250x), v250xr)
   self~assertSame(C2D(v250c,0), '0')
   self~assertSame(C2D(v250x,0), '0')
   self~assertSame(C2D(v250c,249), v250c249r)
   self~assertSame(C2D(v250x,249), v250x249r)
   self~assertSame(C2D(v00x||v250c,249), v250c249r)
   self~assertSame(C2D(v00x||v250x,249), v250x249r)
   self~assertSame(C2D(vFFx||v250c,249), v250c249r)
   self~assertSame(C2D(vFFx||v250x,249), v250x249r)
   self~assertSame(C2D(v250c,250), v250c250r)
   self~assertSame(C2D(v250x,250), v250x250r)
   self~assertSame(C2D(v00x||v250c,250), v250c250r)
   self~assertSame(C2D(v00x||v250x,250), v250x250r)
   self~assertSame(C2D(vFFx||v250c,250), v250c250r)
   self~assertSame(C2D(vFFx||v250x,250), v250x250r)
   NUMERIC DIGITS 602
   self~assertSame(C2D(v250c), v250cr)
   self~assertSame(C2D(v250x), v250xr)
   NUMERIC DIGITS 600
   self~assertSame(C2D(v250c,249), v250c249r)
   self~assertSame(C2D(v250x,249), v250x249r)
   NUMERIC DIGITS 602
   self~assertSame(C2D(v250c,250), v250c250r)
   self~assertSame(C2D(v250x,250), v250x250r)

::class shim public
::method assertEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertNotEquals
  use arg expected, actual
  if expected == actual then do
    say "FAIL not-expected["expected"] actual["actual"]"
    exit 1
  end
::method assertTrue
  use arg condition
  if \condition then do
    say "FAIL expected true actual["condition"]"
    exit 1
  end
::method assertFalse
  use arg condition
  if condition then do
    say "FAIL expected false actual["condition"]"
    exit 1
  end
::method assertNull
  use arg actual
  if actual \== .nil then do
    say "FAIL expected nil actual["actual"]"
    exit 1
  end
::method assertNotNull
  use arg actual
  if actual == .nil then do
    say "FAIL expected non-nil actual nil"
    exit 1
  end
::method assertSame
  use arg expected, actual
  if \(expected == actual) then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertNotSame
  use arg expected, actual
  if expected == actual then do
    say "FAIL not-expected["expected"] actual["actual"]"
    exit 1
  end
::method expectSyntax
  use arg code
  nop
::method assertListEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertArrayEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
