/* extracted from Package_Options::test_options_setPackageOptions_Reset */
::routine main public
  pkg=.routine~new("package4options", ("return .context~package","::OPTIONS DIGITS 21 FUZZ 3"))~call
  ori1 = pkg~options
  ips  = pkg~options("initialPackageSettings")
  ori2 = pkg~options("setPackageOptions", "::OPTIONS digits 11 fuzz 0")
  new1 = pkg~options
  new2 = pkg~options("reset")
  ori3 = pkg~options
  self~assertEquals(ori1, ips )
  self~assertEquals(ori1, ori2)
  self~assertEquals(new1, new2)
  self~assertEquals(ori1, ori3)


::class shim public
::method assertEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertNotEquals
  use arg expected, actual
  if expected == actual then do
    say "FAIL not-expected["expected"] actual["actual"]"
    exit 1
  end
::method assertTrue
  use arg condition
  if \condition then do
    say "FAIL expected true actual["condition"]"
    exit 1
  end
::method assertFalse
  use arg condition
  if condition then do
    say "FAIL expected false actual["condition"]"
    exit 1
  end
::method assertNull
  use arg actual
  if actual \== .nil then do
    say "FAIL expected nil actual["actual"]"
    exit 1
  end
::method assertNotNull
  use arg actual
  if actual == .nil then do
    say "FAIL expected non-nil actual nil"
    exit 1
  end
::method assertSame
  use arg expected, actual
  if \(expected == actual) then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertNotSame
  use arg expected, actual
  if expected == actual then do
    say "FAIL not-expected["expected"] actual["actual"]"
    exit 1
  end
::method expectSyntax
  use arg code
  nop
::method assertListEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertArrayEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
