/* extracted from substr::test_SUBSTR */
::routine main public
    self~assertSame('bc', 'abc'~SUBSTR(2))
    self~assertSame('bc  ', 'abc'~SUBSTR(2,4))
    self~assertSame('bc....', 'abc'~SUBSTR(2,6,'.'))

   -- new tests
    self~assertSame('', 'abc'~SUBSTR(2,0))
    self~assertSame('a', 'abc'~SUBSTR(1,1))
    self~assertSame('c', 'abc'~SUBSTR(3,1))
    self~assertSame(' ', 'abc'~SUBSTR(4,1))
    self~assertSame('  ', 'abc'~SUBSTR(4,2))

::class shim public
::method assertEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertNotEquals
  use arg expected, actual
  if expected == actual then do
    say "FAIL not-expected["expected"] actual["actual"]"
    exit 1
  end
::method assertTrue
  use arg condition
  if \condition then do
    say "FAIL expected true actual["condition"]"
    exit 1
  end
::method assertFalse
  use arg condition
  if condition then do
    say "FAIL expected false actual["condition"]"
    exit 1
  end
::method assertNull
  use arg actual
  if actual \== .nil then do
    say "FAIL expected nil actual["actual"]"
    exit 1
  end
::method assertNotNull
  use arg actual
  if actual == .nil then do
    say "FAIL expected non-nil actual nil"
    exit 1
  end
::method assertSame
  use arg expected, actual
  if \(expected == actual) then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertNotSame
  use arg expected, actual
  if expected == actual then do
    say "FAIL not-expected["expected"] actual["actual"]"
    exit 1
  end
::method expectSyntax
  use arg code
  nop
::method assertListEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertArrayEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
