/* extracted from SysSearchPath::test_searchpath_shell */
::routine main public
  -- sh or cmd.exe should be availabe on PATH
  shell = .RexxInfo~platform~caselessStartsWith("Windows")~?("cmd.exe", "sh")

  self~assertNotSame("", SysSearchPath("PATH", shell))
  self~assertNotSame("", SysSearchPath("PATH", shell, "c"))
  self~assertNotSame("", SysSearchPath("PATH", shell, "n"))

  -- Environment variables on Unix-like systems are
  -- case-sensititve even if the file system isn't, like on Darwin
  if .RexxInfo~platform~caselessStartsWith("windows") then
    return
  self~assertSame("", SysSearchPath("path", shell))

::class shim public
::method assertEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertNotEquals
  use arg expected, actual
  if expected == actual then do
    say "FAIL not-expected["expected"] actual["actual"]"
    exit 1
  end
::method assertTrue
  use arg condition
  if \condition then do
    say "FAIL expected true actual["condition"]"
    exit 1
  end
::method assertFalse
  use arg condition
  if condition then do
    say "FAIL expected false actual["condition"]"
    exit 1
  end
::method assertNull
  use arg actual
  if actual \== .nil then do
    say "FAIL expected nil actual["actual"]"
    exit 1
  end
::method assertNotNull
  use arg actual
  if actual == .nil then do
    say "FAIL expected non-nil actual nil"
    exit 1
  end
::method assertSame
  use arg expected, actual
  if \(expected == actual) then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertNotSame
  use arg expected, actual
  if expected == actual then do
    say "FAIL not-expected["expected"] actual["actual"]"
    exit 1
  end
::method expectSyntax
  use arg code
  nop
::method assertListEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
::method assertArrayEquals
  use arg expected, actual
  if expected \== actual then do
    say "FAIL expected["expected"] actual["actual"]"
    exit 1
  end
