/* .context~executable in a method enhanced installed. */
o = .object~enhanced(.directory~of(('MM', 'return .context~executable~class~id')))
say o~mm
