/* .context~executable in a .METHODS method run ran. */
say .t~new~go
::method fm
return .context~executable~class~id
::class t
::method go
return self~run(.methods['FM'])
