numeric digits 9
say ( 1 =  1.0 ) ( 1 == 1.0 ) ( "1" == "1" )
say ( 1 <  2 ) ( 2 <= 2 ) ( 3 >  2 ) ( 3 >= 4 )
say ( 1 \= 2 ) ( 1 \== 1.0 )
say ( "a" << "b" ) ( "b" >> "a" ) ( " 1" == "1" )
say ( "1.0" = "1" ) ( "1.0" == "1" )
say ( 0 = -0 ) ( "0" == "-0" )
say ( 1e2 = 100 ) ( "1e2" == "100" )
