numeric digits 9
say 1e10 * 1 , 1e-10 * 1
say 123456789 * 10
say 1234567890 * 1
say 0.0000001 * 1
say 0.00000001 * 1
say 1e9 * 1 , 1e-9 * 1
x = 1e100
say x * 1
say x / 1e50
say (1e-100) * (1e-100)
