numeric digits 9
numeric form scientific
say "sci :" 12345678901 * 1
say "sci :" 0.00000012345 * 1
numeric form engineering
say "eng :" 12345678901 * 1
say "eng :" 0.00000012345 * 1
say "eng :" 1234 * 1000000
numeric form scientific
say "back:" 12345678901 * 1
say form()
numeric form engineering
say form()
