/* provide.xml `abscla`: an abstract class provides definitions but is not
   intended to create instances, and trying to create one is an error. */
say 'declared' .ab~id .ab~class~id
say 'instance' .ab~new

::class ab abstract
