signal on syntax
r = LoadIt('lr2')
say 'returned' r LDtors()
say 'again' LoadIt('lr2') LDtors()
exit
syntax: say 'trapped' rc condition('o')~code LDtors()
::requires 'lr' LIBRARY
