o = .k~new
say o~a
say o~b
say 'main 1'
say 'main 2'
::class k
::method a unguarded
  reply 'ra'
  say 'a rest'
::method b unguarded
  reply 'rb'
  say 'b rest'
